# -*-coding:utf-8 -*- #
# ---------------------------------------------------------------------------
# ProjectName:   python51
# FileName:      demo_for1009.py
# Author:        xm
# Datetime:      2022/10/9 17:12
# Description:
# 命名规范：文件名全小写+下划线，类名大驼峰，方法和变量小写+下划线连接，
# 变量用名词，方法用动词
# ---------------------------------------------------------------------------


list1 = [1,2,3,4]
# 取出list1中的数据有两种方式
# 1、通过切片的方式取元素3
print(list1[-2])
# 2、通过遍历的方式再结合if语句将元素3取出并打印
for i in list1:# 把可迭代对象中的所有元素取出来
    if i==3:# 做判断或者做筛选的意思
        print(i)

# for 循环语句的使用
# 1、就是遍历数据(建立在循环的基础上的)
for i in list1:# i=1,i=2,i=3,i=4
    print(i)
# 2、就是一个简单的循环语句
for i in range(10):
    print(f'老王喜欢小花{i}年了')


# 使用for....else...语句
for i in range(1,10):
    print(f'老王喜欢小花{i}年了')
    # if i==6:
    #     print('老王喜欢别人了')
    #     break# 表示终止循环
else:# else和for搭配，表示的意思是循环语句正常结束后，才会执行else里面的代码
    print('老王变心了，喜欢小桂子了')
# print('老王变心了，喜欢小桂子了')


# 用for循环实现1+2+3+...+100，并输出计算结果
print(sum(range(101)))
he = 0# 给一个和的初始变量，变量值为0
for i in range(101):# 循环遍历出每个数
    he=he+i# he+=i

print(he)
